Revit 2027 API
SchedulableField.ParameterId Property
 The ID of the parameter displayed by the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParameterId { get; set; }
Public Property ParameterId As ElementId
	Get
	Set
public:
property ElementId^ ParameterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ParameterId : ElementId with get, set
Property Value
ElementId
 The parameter ID, or InvalidElementId.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Most non-calculated field types require a parameter ID. The Count field doesn't have a parameter ID.
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace